In [1]:
#importing library & dataset
import pandas as pd
df = pd.read_csv('C:/Users/admin1/Documents/GitHub/ds22_project/data/movies.csv')

In [2]:
df.head(2)

,Title,Rating,Year,Month,Certificate,Runtime,Directors,Stars,Genre,Filming_location,Budget,Income,Country_of_origin
0,Avatar: The Way of Water,7.8,2022,December,PG-13,192,James Cameron,"Sam Worthington, Zoe Saldana, Sigourney Weaver...","Action, Adventure, Fantasy",New Zealand,"$350,000,000","$2,267,946,983",United States
1,Guillermo del Toro's Pinocchio,7.6,2022,December,PG,117,"Guillermo del Toro, Mark Gustafson","Ewan McGregor, David Bradley, Gregory Mann, Bu...","Animation, Drama, Family",USA,"$35,000,000","$108,967","United States, Mexico, France"

In [3]:
#function
def check_non_numeric_values(df, column):
    """Function takes in dataset and column. No kreturn, Printing out found non numeric values in the column."""

    # convert column to numeric data type
    numeric_col = pd.to_numeric(df[column], errors='coerce')

    # get the non-numeric values and their counts
    non_numeric_values = df[column][numeric_col.isna()].value_counts()

    # check if there are any non-numeric values
    if non_numeric_values.empty:
        print("No non numeric values in that column.")
    else:
        # create a table with non-numeric values and their counts
        non_numeric_table = pd.DataFrame({'Non-Numeric Value': non_numeric_values.index,
                                          'Count': non_numeric_values.values})

        # display the table
        print(non_numeric_table)

In [7]:
#using the function on dataset df & column Runtime
#something to note is all rows that have atlest 1 charchater that is non numeric will show up.
#for example 2333b, $2333 and 2333! will all be considered to be non-numeric with this function

In [5]:
check_non_numeric_values(df, "Runtime")

    Non-Numeric Value  Count
0             Unknown    304
1        $30,000,000      73
2        $40,000,000      65
3        $20,000,000      58
4        $25,000,000      54
..                ...    ...
300      $18,026,148       1
301     $176,000,000       1
302       € 6,000,000      1
303       $8,900,000       1
304       € 4,800,000      1

[305 rows x 2 columns]